tutorials/reactiveTransport/reactive_Vol/constant/reactionDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      reactionDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

//              k*prod(C_i^exponents_i)
// r = ------------------------------------------------
//     {1+sum[(Ks_i*C_i)^exponentsS_i]}^exponentsS_total

//k [ 0 -3(1-n) -1 0 (1-n) 0 0] 

zoneName    catalyst;   // Name of the cellsZone where the reaction occurs and where use the solid diffusion. You can e "all" to consider all cells

reactions
(
    reaction1
    {
        // Reaction coefficients
        k             k [0 0 -1 0 0 0 0] 0.5;
        species       (Cg Ch);   //species involved in the reaction
        stoichiometry (-1 7);
        exponents     (1 0);
        kS            (0 0);
        exponentsS    (0 0);
        exponentsS_total 0;
        zoneName all;           // This reaction occurs in all the domain
        
    }

    reaction2
    {
        // Reaction coefficients
        k             k [0 0 -1 0 0 0 0] 10;
        species       (Cg Ch Cp);   //species involved in the reaction
        stoichiometry (0 -1 1);
        exponents     (0 1 0);
        kS            (0 1e-1 0);
        exponentsS    (0 1 0);
        exponentsS_total 1;
    }

);